---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.TopRail
source: html/fed85125-b2ad-70e0-73d7-261180e09bf6.htm
---
# TopRail Properties

The id of the assembly instance to which the element belongs.